<template>
  <v-dialog width="75%" v-model="rules">
    <v-card style="padding: 15px; text-align: center">
      <h3>Правила игры в "Карточки:"</h3>
      <!-- <br /> -->
      Игрокам даётся две темы: первая - на совпадение, вторая - на несовпадение.
      <br />
      В игре на совпадение игрокам нужно предложить 6 ассоциаций на заданную
      тему таким образом,
      <!-- <br /> -->
      чтобы было как можно больше совпадений с другими игроками.
      <br />
      В игре на несовпадение игрокам нужно предложить 6 ассоциаций на заданную
      тему таким образом,
      <!-- <br /> -->
      чтобы было как можно меньше совпадений с другими игроками.
      <br />
      Победители определяются суммой совпадений и несовпадений. <br />
      В игре могут участвовать от двух до четырёх игроков.
      <br />
      Игрок может создать свою игру (со своими темами или случайными) и
      пригласить других игроков.
      <br />
      Или игрок может присоединиться к другой игре.
      <br />
      Игрок, создавший игру является ведущим и судьёй игры.
      <br />
      Кроме того, в игре есть режим дуэли, в которой делаются ставки на
      количество совпадений и несовпадений.
      <br />
      Если ставка меньше количества совпадений/несовпадений - игрок получает то
      количество очков, которое поставил.
      <br />
      Если ставка больше количества совпадений/несовпадений - игрок не получает
      очков.
      <br />
      Если ставка равна количеству совпадений/несовпадений - игрок получает
      соответствующее количество очков. Победитель определяется суммой всех
      набранных очков.
      <br />
      <h3>Приятной игры!</h3>
    </v-card>
  </v-dialog>
</template>

<script setup lang="ts">
import Parse from "parse";

// Инициализация Parse SDK (добавьте ваши ключи и URL)
Parse.initialize(
  "4RlgR1kapPiYAeXxd3NZYhrFnzPmUhDs3eiNvUyW",
  "MEnppDlziXN2QSIt16oli8kgQufCpCn0mByZTInq"
);
Parse.serverURL = "https://parseapi.back4app.com/";

import { useGameStore } from "../store/game";
import { storeToRefs } from "pinia";

const gameStore = useGameStore();
const { rules } = storeToRefs(gameStore);
</script>
